Repository: kirkerafael/edx-sga
Catalog: edx_sga/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Staff Graded Assignment
pl: Zadanie oceniane przez Nauczyciela

source: This name appears in the horizontal navigation at the top of the page.
pl: Ta nazwa pojawi się na pasku nawigacji.

source: Problem Weight
pl: Waga problemu

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
pl: Ustala, ile punktów warte jest każde zadanie. Jeśli wartość nie jest ustalona, zadanie jest warte sumie wartości punktów jego składowych.

source: Maximum score
pl: Maksymalny wynik

source: Maximum grade score given to assignment by staff.
pl: Maksymalna wartość wyniku nadawana przez nauczyciela.

source: Score assigned by non-instructor staff
pl: Wynik nadany przez obsługę, która nie jest instruktorem

source: Score will need to be approved by instructor before being published.
pl: Wynik będzie musiał być zaaprobowany przez instruktora przed opublikowaniem.

source: Instructor comment
pl: Komentarz instruktora

source: Feedback given to student by instructor.
pl: Komentarz przekazany studentowi przez instruktora.

source: Annotated SHA1
pl: SHA1 komentarza

source: sha1 of the annotated file uploaded by the instructor for this assignment.
pl: Suma kontrolna (SHA1) pliku z komentarzem dodanego przez instruktora do tego zadania.

source: Annotated file name
pl: Nazwa pliku z komentarzem

source: The name of the annotated file uploaded for this assignment.
pl: Nazwa pliku z komentarzem dodanego do tego zadania.

source: Mime type of annotated file
pl: Typ pliku z komentarzem

source: The mimetype of the annotated file uploaded for this assignment.
pl: Typ MIME pliku z komentarzem dodanego do tego zadania.

source: Timestamp
pl: Sygnatura czasowa

source: When the annotated file was uploaded
pl: Kiedy plik z komentarzem został dodany

source: Settings
pl: Ustawienia

source: File uploaded
pl: Dodany plik

source: No file has been uploaded.
pl: Żaden plik nie został dodany

source: Your score is %(graded_score)s / %(max_score)s
pl: Twój wynik to %(graded_score)s / %(max_score)s

source: Annotated file from instructor
pl: Plik z komentarzem od instruktora

source: This assignment has not yet been graded.
pl: To zadanie nie zostało jeszcze ocenione.

source: Upload a different file
pl: Zamień plik na inny

source: Upload your assignment
pl: Dodaj plik

source: Select a file
pl: Wybierz plik

source: Username
pl: Nazwa użytkownika

source: Name
pl: Nazwa

source: Filename
pl: Nazwa pliku

source: Uploaded
pl: Data dodania

source: Grade
pl: Wynik

source: Instructor's comments
pl: Komentarz instruktora

source: Annotated
pl: Skomentowany

source: Actions
pl: Zadania

source: Awaiting instructor approval
pl: Oczekuje weryfikacji przez nauczyciela

source: Approve grade
pl: Zaakceptuj wynik

source: Enter grade
pl: Wprowadź wynik

source: Upload annotated file
pl: Dodaj plik z komentarzem

source: Grade Submissions
pl: Oceń zgłoszenia

source: Loading...
pl: Ładowanie

source: Enter Grade
pl: Podaj wynik

source: Grade for %(student_name)s
pl: wynik użytkownika %(student_name)s

source: Grade:
pl: Wynik:

source: Comment:
pl: Komentarz:

source: Submit
pl: Wyślij

source: Cancel
pl: Anuluj

source: Remove grade
pl: Usuń wynik

source: Solution
pl: Odpowiedź

source: Solution to the problem to show to the user
pl: Odpowiedź na zadanie pokazywana użytkownikowi

source: Accepted filetypes
pl: Akceptowane typy plików

source: Accepted filetypes, like: ^image\/(gif|jpe?g|png)$, ^application\/(pdf|document)$
pl: Akceptowane typy plików, np.: ^image\/(gif|jpe?g|png)$, ^application\/(pdf|document)$
